In [5]:
import pandas as pd

In [14]:
df = pd.read_csv('D:/HACKTIV8/Student_Marks.csv')

In [15]:
len(df)

100

In [16]:
df.shape

(100, 3)

In [17]:
df.head()

   number_courses  time_study   Marks
0               3       4.508  19.202
1               4       0.096   7.734
2               4       3.133  13.811
3               6       7.909  53.018
4               8       7.811  55.299

In [20]:
df.tail()

    number_courses  time_study   Marks
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

In [21]:
df.tail(3)

    number_courses  time_study   Marks
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  100 non-null    int64
 1   time_study      100 non-null    float64
 2   Marks           100 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [23]:
df.describe()

       number_courses  time_study       Marks
count      100.000000  100.000000  100.000000
mean         5.290000    4.077140   24.417690
std          1.799523    2.372914   14.326199
min          3.000000    0.096000    5.609000
25%          4.000000    2.058500   12.633000
50%          5.000000    4.022000   20.059500
75%          7.000000    6.179250   36.676250
max          8.000000    7.957000   55.299000

In [25]:
df["time_study"].value_counts()

2.438    1
6.063    1
1.803    1
1.954    1
7.451    1
        ..
4.633    1
2.966    1
4.182    1
0.156    1
4.875    1
Name: time_study, Length: 100, dtype: int64